app/Filament/Widgets/StatsOverview.php

select MONTH(report_date_time) as month, count(*) as total from `object_incidents` where year(`report_date_time`) = '2025' group by MONTH(report_date_time)
select MONTH(report_date_time) as month, count(*) as total from `object_incidents` where year(`report_date_time`) = '2025' and `standing_still` = 1 group by MONTH(report_date_time)
select MONTH(executed_datetime) as month, count(*) as total from `object_inspections` where year(`executed_datetime`) = '2025' and `status_id` = '1' and `object_inspections`.`deleted_at` is null group by MONTH(executed_datetime)
select MONTH(executed_datetime) as month, count(*) as total from `object_inspections` where year(`executed_datetime`) = '2025' and `status_id` = '2' and `object_inspections`.`deleted_at` is null group by MONTH(executed_datetime)
select MONTH(executed_datetime) as month, count(*) as total from `object_inspections` where year(`executed_datetime`) = '2025' and `status_id` = '3' and `object_inspections`.`deleted_at` is null group by MONTH(executed_datetime)
---
    protected function getStats(): array
    {

        $incidentChart = ObjectIncident::select(DB::raw('MONTH(report_date_time) as month'), DB::raw('count(*) as total'))
            ->whereYear('report_date_time', '2025')
            ->groupBy(DB::raw('MONTH(report_date_time)'))
            ->pluck('total', 'month')
            ->toArray();

        $incidentStillChart = ObjectIncident::select(DB::raw('MONTH(report_date_time) as month'), DB::raw('count(*) as total'))
            ->whereYear('report_date_time', '2025')
            ->where('standing_still', 1)
            ->groupBy(DB::raw('MONTH(report_date_time)'))
            ->pluck('total', 'month')
            ->toArray();

        $inspectionApporovedChart = ObjectInspection::select(DB::raw('MONTH(executed_datetime) as month'), DB::raw('count(*) as total'))
            ->whereYear('executed_datetime', '2025')
            ->where('status_id', InspectionStatus::APPROVED)
            ->groupBy(DB::raw('MONTH(executed_datetime)'))
            ->pluck('total', 'month')
            ->toArray();

        $inspectionApporovedActionsChart = ObjectInspection::select(DB::raw('MONTH(executed_datetime) as month'), DB::raw('count(*) as total'))
            ->whereYear('executed_datetime', '2025')
            ->where('status_id', InspectionStatus::APPROVED_ACTIONS)
            ->groupBy(DB::raw('MONTH(executed_datetime)'))
            ->pluck('total', 'month')
            ->toArray();

        $inspectionRejectedChart = ObjectInspection::select(DB::raw('MONTH(executed_datetime) as month'), DB::raw('count(*) as total'))
            ->whereYear('executed_datetime', '2025')
            ->where('status_id', InspectionStatus::REJECTED)
            ->groupBy(DB::raw('MONTH(executed_datetime)'))
            ->pluck('total', 'month')
            ->toArray();

select count(*) as aggregate from `object_incidents`
select count(*) as aggregate from `object_incidents` where `standing_still` = 1
select count(*) as aggregate from `elevators` where `status_id` = '2' and `elevators`.`deleted_at` is null
select count(*) as aggregate from `elevators` where `current_inspection_status_id` = '1' and `elevators`.`deleted_at` is null
select count(*) as aggregate from `elevators` where `current_inspection_status_id` = '2' and `elevators`.`deleted_at` is null
select count(*) as aggregate from `elevators` where `current_inspection_status_id` = '3' and `elevators`.`deleted_at` is null
---
        return [
            Stat::make('Stilstaande objecten', Elevator::has("incident_stand_still")->latest()->count())
                ->chart($inspectionRejectedChart),
            Stat::make('Storingen', ObjectIncident::count())
                ->color('success')
                ->chart($incidentChart),
            Stat::make('Storingen stilstand', ObjectIncident::where('standing_still', 1)->count())
                ->chart($incidentStillChart)
                ->color('danger'),
            Stat::make('Objecten buitenbedrijf', Elevator::where('status_id', ElevatorStatus::TURNEDOFF)->count())
                ->color('danger'),
            Stat::make('Goedgekeurd', Elevator::where('current_inspection_status_id', InspectionStatus::APPROVED)->count())
                ->chart($inspectionApporovedChart),
            Stat::make('Goedgekeurd met acties', Elevator::where('current_inspection_status_id', InspectionStatus::APPROVED_ACTIONS)->count())
                ->chart($inspectionApporovedActionsChart)
                ->color('warning'),
            Stat::make('Afgekeurd dit jaar', Elevator::where('current_inspection_status_id', InspectionStatus::REJECTED)->count())
                ->chart($inspectionApporovedActionsChart)
                ->color('danger'),

            Stat::make('Afgekeurd dit jaar', Elevator::where('current_inspection_status_id', InspectionStatus::REJECTED)->count())